Enums/упТипОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СШП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Web</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/сшпТипыКоннекторовESB.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>сшпТипыКоннекторовESB</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>REST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SOAP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/сшпРежимыПередачиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>сшпРежимыПередачиСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Single</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Batch</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/сшпФормаКонстант/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если сшпОбновлениеВерсииКонфигурации.ВыполнитьОбновлениеДанныхКонфигурации() Тогда 
		ОбновитьНаСервере();
	Иначе
		ПрочитатьТаблицуДлительностиХранения();
		УправлениеВидимостью();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

// +++.17/06/05-11:25:00.<УП>
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура упТипОбменаПриИзменении(Элемент)
	
	УправлениеВидимостью();
	Если НаборКонстант.упТипОбмена <> ПредопределенноеЗначение("Перечисление.упТипОбмена.Web") Тогда 
	    НаборКонстант.сшпАдресАдаптераESB              = "";
	    НаборКонстант.сшпТипИспользуемогоКоннектораESB = Неопределено;
	    НаборКонстант.сшпИмяСервисаESB                 = "";
	    НаборКонстант.сшпФорматСообщений               = Неопределено;
	    НаборКонстант.сшпРежимПередачиСообщений        = Неопределено;
	    НаборКонстант.сшпРазмерПакета                  = 0;
	    НаборКонстант.упПользовательWebСервиса         = "";
	    НаборКонстант.упПарольWebСервиса               = "";
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
// ---.17/06/05-11:25:00.<УП>

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьТаблицуДлительностиХранения()
	
	РеквизитыФормы = ПолучитьРеквизиты("ТаблицаДлительностиХранения");
	
	МассивУдаляемыхРеквизитов = Новый Массив;
	Для Каждого Колонка Из РеквизитыФормы Цикл 
		МассивУдаляемыхРеквизитов.Добавить(Колонка.Имя);
	КонецЦикла;   

	ТЗКонстанта = сшпРаботаСКонстантами.ПолучитьДлительностьХранения();
	МассивДобавляемыхРеквизитов = Новый Массив;
	Для Каждого Колонка Из ТЗКонстанта.Колонки Цикл 
		ИндексНайденного = МассивУдаляемыхРеквизитов.Найти(Колонка.Имя);
		Если ИндексНайденного = Неопределено Тогда 
			НовыйРеквизит = Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения), "ТаблицаДлительностиХранения", Колонка.Заголовок);
			МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
		Иначе
			МассивУдаляемыхРеквизитов.Удалить(ИндексНайденного);
		КонецЕсли;
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
	РеквизитыФормы = ПолучитьРеквизиты("ТаблицаДлительностиХранения");
	ТаблицаДлительностиХранения.Загрузить(ТЗКонстанта);
	
	Для Каждого Колонка Из МассивДобавляемыхРеквизитов Цикл 
		Элемент = Элементы.Добавить("ТаблицаДлительностиХранения" + Колонка.Имя, Тип("ПолеФормы"), Элементы.ТаблицаДлительностиХранения);
		Элемент.ПутьКДанным = "ТаблицаДлительностиХранения." + Колонка.Имя;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
	КонецЦикла;   
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
	// +++.17/06/05-11:25:00.<УП>
	//НомерВерсии = Формат(сшпКэшируемыеФункции.ВерсияПодсистемы(), "ЧГ=0");
	//Если НомерВерсии = "10000" Тогда
	//	Элементы.сшпИспользоватьСШП.Заголовок = "Использовать подсистему Datareon";
	//Иначе
	//	Элементы.сшпИспользоватьСШП.Заголовок = "Использовать  подсистему Datareon (версия подсистемы " + Формат(НомерВерсии, "ЧГ=0") + ")";
	//КонецЕсли;
	//
	//Элементы.сшпРазмерПакета.Видимость = НаборКонстант.сшпРежимПередачиСообщений = Перечисления.сшпРежимыПередачиСообщений.Batch;
	//Элементы.сшпДлительностьОжидания.Видимость = Не НаборКонстант.сшпАвтоматическийСтартОбработчиков;
	
	Если НаборКонстант.упТипОбмена = ПредопределенноеЗначение("Перечисление.упТипОбмена.Web") Тогда 
		
		Для каждого текЭлемент Из Элементы.ГруппаНастройкиПодсистемы1С.ПодчиненныеЭлементы Цикл
			Если текЭлемент.ПодчиненныеЭлементы.Количество() Тогда
				
			Иначе
				текЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли; 
		КонецЦикла; 
		Элементы.ГруппаТочкаПодключения.ТекущаяСтраница = Элементы.ГруппаWeb;
		Элементы.сшпФорматДляСериализации.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.сшпМаксимальноеКоличествоПотоковОбработкиВходящих.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.сшпМаксимальноеКоличествоПотоковОбработкиИсходящих.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.сшпДлительностьОжидания.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.сшпАвтоматическийСтартОбработчиков.ТолькоПросмотр = Ложь;
		Элементы.сшпОтключитьПотокиОбработкиДанных.ТолькоПросмотр = Ложь;
		Элементы.сшпДлительностьХраненияСообщений.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.ТаблицаДлительностиХранения.Видимость = Ложь;
		Элементы.сшпИмяСервисаESB1.Видимость = Ложь;
		
		Элементы.сшпИспользоватьСШП.Заголовок = НСтр("ru = 'Использовать обмен данными'");
		Элементы.ГруппаНастройкиПодсистемы1С.Заголовок = НСтр("ru = 'Настройки'");
		// +++.17/06/05-11:25:00.<УП>
		Элементы.сшпИмяСервисаESB2.Видимость = НаборКонстант.сшпТипИспользуемогоКоннектораESB = Перечисления.сшпТипыКоннекторовESB.REST;
		// ---.17/06/05-11:25:00.<УП>
	Иначе	
		Элементы.ГруппаТочкаПодключения.ТекущаяСтраница = Элементы.ГруппаESB;
		// +++ не измененый текст Datareon.<УП>
		НомерВерсии = Формат(сшпКэшируемыеФункции.ВерсияПодсистемы(), "ЧГ=0");
		Если НомерВерсии = "10000" Тогда
			Элементы.сшпИспользоватьСШП.Заголовок = "Использовать подсистему Datareon";
		Иначе
			Элементы.сшпИспользоватьСШП.Заголовок = "Использовать  подсистему Datareon (версия подсистемы " + Формат(НомерВерсии, "ЧГ=0") + ")";
		КонецЕсли;
		
		Элементы.сшпРазмерПакета.Видимость = НаборКонстант.сшпРежимПередачиСообщений = Перечисления.сшпРежимыПередачиСообщений.Batch;
		Элементы.сшпДлительностьОжидания.Видимость = Не НаборКонстант.сшпАвтоматическийСтартОбработчиков;
		// --- не измененый текст Datareon.<УП>
		Элементы.ГруппаНастройкиПодсистемы1С.Заголовок = НСтр("ru = 'Настройки подсистемы ESB'");
		
		Элементы.сшпФорматДляСериализации.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.сшпМаксимальноеКоличествоПотоковОбработкиВходящих.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.сшпМаксимальноеКоличествоПотоковОбработкиИсходящих.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.сшпДлительностьОжидания.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.сшпАвтоматическийСтартОбработчиков.ТолькоПросмотр = Истина;
		Элементы.сшпОтключитьПотокиОбработкиДанных.ТолькоПросмотр = Истина;
		Элементы.сшпДлительностьХраненияСообщений.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.сшпИмяСервисаESB1.Видимость = Истина;
		
		Элементы.ТаблицаДлительностиХранения.Видимость = Истина;
	КонецЕсли;
	// ---.17/06/05-11:25:00.<УП>
	
КонецПроцедуры // УправлениеВидимостью()

&НаКлиенте
Процедура ОбновитьИдентификаторИБ(Команда)
	ОбновитьИдентификаторИБНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИдентификаторИБНаСервере()
	ФоновыеЗадания.Выполнить("сшпРаботаСКонстантами.УстановитьИдентификаторИБ",, "УстановитьИдентификаторИБ", "УстановитьИдентификаторИБ");
КонецПроцедуры

&НаКлиенте
Процедура сшпИспользоватьСШППриИзменении(Элемент)
	сшпИспользоватьСШППриИзмененииНаСервере();
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервере
Процедура сшпИспользоватьСШППриИзмененииНаСервере()
		КонстантаМенеджер = Константы.сшпИспользоватьСШП;
		КонстантаЗначение = НаборКонстант.сшпИспользоватьСШП;
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
			Если КонстантаЗначение = Истина Тогда 
				сшпОбновлениеВерсииКонфигурации.ВыполнитьОбновлениеДанныхКонфигурации();
			КонецЕсли;
			ОбновитьПовторноИспользуемыеЗначения();
			УправлениеВидимостью();
		КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ОбновитьПовторноИспользуемыеЗначения();
	НК = РеквизитФормыВЗначение("НаборКонстант", Тип("КонстантыНабор"));
	НК.Прочитать();
	ЗначениеВРеквизитФормы(нк, "НаборКонстант");
	ПрочитатьТаблицуДлительностиХранения();
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

// +++.17/06/05-11:25:00.<УП>
&НаКлиенте
Процедура ТипИспользуеммогоКоннектораESB1ПриИзменении(Элемент)
	
	Элементы.сшпИмяСервисаESB2.Видимость = НаборКонстант.сшпТипИспользуемогоКоннектораESB = ПредопределенноеЗначение("Перечисление.сшпТипыКоннекторовESB.REST");
	
КонецПроцедуры
// ---.17/06/05-11:25:00.<УП>

&НаКлиенте
Процедура сшпАдресАдаптераESBНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеНажатияАдресАдаптера", ЭтотОбъект);

	НачатьЗапускПриложения(Оповещение, ПолучитьАдресСервисаАдаптера());
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресСервисаАдаптера()
	сшпАдресАдаптераESB = сшпФункциональныеОпции.АдресАдаптераESB();
 	типКоннектора = сшпФункциональныеОпции.ТипИспользуемогоКоннектораESB();
	Если типКоннектора = Перечисления.сшпТипыКоннекторовESB.REST тогда
		Возврат "http://" + сшпАдресАдаптераESB + сшпФункциональныеОпции.ИмяСервисаESB() + "/sendMessage";
	ИначеЕсли типКоннектора = Перечисления.сшпТипыКоннекторовESB.SOAP тогда
		Возврат сшпАдресАдаптераESB + "?singlewsdl";
	Иначе
		Возврат сшпАдресАдаптераESB;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПослеНажатияАдресАдаптера(ВыбранныйЭлемент, Параметры) Экспорт
	// Процедура заглушка, т.к. НачатьЗапускПриложения требуется наличие обработчика оповещения.
КонецПроцедуры

#КонецОбласти
